import 'package:mazratii/database/Diseases/Disease.dart';

Disease Alternaria_Solani = Disease(
    name: 'الندوة المبكرة',
    Cause: 'Alternaria Solani',
    conditions:
        ' الضعف العام للنباتات بسبب نقص بعض العناصر الغذائية أو نقص التسميد العضوي – الرطوبة المرتفعة ووجود الندي – درجة الحرارة الملائمة للإصابة من 24-29°م تقريبًا.',
    preventionAndTreatment:
        'اتباع دورة زراعية ملائمة يراعى فيها عدم تكرار زراعة بطاطس وطماطم في نفس الحقل سنين متتالية – التخلص من بقايا النباتات المصابة وحرقها، وعدم استخدامها في عمل الكمبوست – العناية بخدمة المحصول وتسميده جيدا ليكون قويا ويقاوم المرض – عدم زراعة شتلات مصابة – الرش بالمبيدات الفطرية المناسبة الوقائية منها والعلاجية طبقا لتوصيات وزارة الزراعة.',
    symptoms: 'ظهر على الأوراق والسيقان بقع جلدية الملمس صغيرة محدودة لونها بني داكن أو مسود قد يصل قطرها إلي 3-4 سم، تتميز بوجود حلقات دائرية داخلها وتظهر البقع أولا على الأوراق السفلية ثم تنتشر على الأوراق العليا');
