import 'package:mazratii/database/Diseases/Disease.dart';

Disease Insect = Disease(
    name: 'خنفساء البطاطس الكولورادو',
    Cause: 'Leptinotarsa decemlineata',
    conditions:
        'الطقس الدافئ والجاف، والتربة الرطبة، والنباتات المضيفة مثل الباذنجان والطماطم.',
    preventionAndTreatment:
        'استخدام أصناف مقاومة للمرض، والمناوبة الزراعية، وزراعة مصائد المحاصيل، وجمع الخنافس واليرقات يدويًا، واستخدام مبيدات الحشرات عند الحاجة.',
    symptoms:
        'تتغذى الخنافس واليرقات على أوراق نبات البطاطس، مما يتسبب في ثقوب وندبات على الأوراق. يمكن أن تؤدي الإصابة الشديدة إلى موت النبات.');
