import 'package:mazratii/database/Diseases/Disease.dart';

Disease Pepper_bell_Bacterial_Spot = Disease(
    name: 'البقع البكتيرية الفلفل الحلو (عفن)',
    Cause: 'Xanthomonas campestris pv. vesicatoria',
    symptoms: '''
    'بقع مائية صغيرة على الأوراق والسيقان والثمار تكبر وتغمق',
    'اصفرار وجفاف وتساقط الأوراق المصابة',
    'تشقق الثمار المصابة وفقدان جودتها التسويقية',
  ''',
    preventionAndTreatment: '''
    'استخدام بذور خالية من المرض',
    'الري بالتنقيط لتقليل الرطوبة على الأوراق',
    'تحسين التهوية بين النباتات',
    'تغذية متوازنة لتقوية مناعة النبات',
''',
    conditions: '''
    يحدث مرض التبقع البكتيرى فى كل أنحاء العالم، ويعتبر من الأمراض الخطيرة على الطماطم والفلفل التى تزرع فى البيئات
الدافئة الرطبة. يمكن لمسبب المرض البقاء على لب البذور أو العيش على سطحها، وأحياناً ما يبقى على حشائش معينة تعتبر
مضيفات بديلة. وينتشر فيما بعد عن طريق رذاذ الأمطار أو الري بالرشاشات العلوية. وعادة مايدخل مسبب المرض الى أنسجة
النباتات عبر مسامات الورقة والخدوش. وتعتبر درجة الحرارة المثلى لانتشار المرض من 25 إلى 30 درجة مئوية. وفي حال
حدوث الاصابة فى المحصول، فإنه يكون من الصعب جداً السيطرة على المرض أو مكافحته، وقد يتسبب فى فقدان كامل
المحصول.
  ''');
