import 'package:mazratii/database/Diseases/Disease.dart';

Disease Phytophthora_infestans = Disease(
  name: 'اللفحةالمتأخرة',
  Cause: 'Phytophthora infestans',
  conditions:
      'الظروف الرطبة والتى تستمر لفترة من الزمن مثل وجود الضباب أو الندىأو األمطار مما يؤدى إلى تشبع الجو بالرطوبة العالية كما تساعد طرق الرىبالرش المحورى أو الوسائل األخرى للرى بالرش على تطور المرض بسرعة',
  preventionAndTreatment:
      '- عدم زراعة الدرنات المصابة\n- الرش بالمبيدات التالية: الكوسيد أو أوكسى كلورو النحاس بمعدل 500 جم/ 100 لتر ماء ويكرر الرش كل 15-10 يوما\n- في حالة بداية ظهور المرض البد من إجراء الرش العلاجي بأحد المبيدات الجهازية التالية: الريدوميل بالس بمعدل 150 جم/ 100 لتر ماء أو بريفيكيور – إن أو جالبين نحاس أو أكروبات نحاس بمعدل 250 سم3 لألول أو 250 جم للثاني والثالث لكل 100 لتر ماء مع مراعاة أن يرش الفدان بـ 400 لتر ماء تزاد إلى 600 لتر ماء في الرشة أو الرشتين الأخيرتين.\n- يجب إجراء الرش التناوبي بالمبيدات الجهازية المذكورة مرة كل 10-7 أيام لتفادي ظهور المقاومة المكتسبة.',
  symptoms:
      'ظهور بقع داكنة على الأوراق والسيقان، تدهور الأوراق والأغطية الخضراء للثمار، تلف الثمار وتخريبها.',
);
