import 'package:mazratii/database/Diseases/Disease.dart';

Disease leafScorch = Disease(
  name: 'لطخة الأوراق',
  Cause: 'Diplocarpon earliana',
  conditions:
      'تحدث تحت ظروف مناسبة مثل درجات حرارة معتدلة، رطوبة عالية، وهطول مطر متكرر. شائعة في المشاتل حيث يتم استخدام الري العلوي.',
  preventionAndTreatment: '''
  - زراعة شتلات سليمة ومعتمدة ومقاومة أو متحملة للإصابة.
  - الزراعة في أراضي جيدة الصرف.
  - جمع المخلفات النباتية وحرقها.
  - تقليل الرطوبة حول النباتات.
  - الرش بأحد المبيدات الموصى بها والمعتمدة كل 10-15 يومًا حسب شدة الإصابة والظروف الجوية المحيطة.
  ''',
  symptoms:
      'تظهر بقع بنية تتحول إلى بنفسجية دون وجود لون أبيض في الوسط. تتأثر الأوراق والسيقان والثمار والتيجان بشكل شديد وقد تموت في الحالات الشديدة.',
);

