import 'package:mazratii/database/Diseases/Disease.dart';

Disease Strawberry_Leaf_Scorch = Disease(
    name: 'حرق أوراق الفراولة (لسعة أوراق الفراولة)',
    Cause: 'فطر Diplocarpon earlianum',
    conditions:
        'الري الزائد بالرش العلوي أو كميات كبيرة من الأمطار، والطقس الحار الرطب، وضعف دوران الهواء، والزراعة الكثيفة.',
    preventionAndTreatment:
        'استخدام أصناف مقاومة للمرض، والمناوبة الزراعية، والحفاظ على دوران جيد للهواء، وتجنب الري العلوي، وإزالة وحرق النباتات المصابة، واستخدام مبيدات الفطريات عند الحاجة.',
    symptoms:
        'تظهر بقع صغيرة بنية محمرّة على الأسطح العلوية للأوراق. تكبر هذه البقع وتتحول إلى اللون البني المحمر، وقد تلتحم لتشكل مناطق محروقة. تذبل الأوراق وتتحول إلى اللون البني وتموت. قد تتأثر الفاكهة أيضًا، حيث تتطور بقع صغيرة غائرة على السطح.');
